UNFCOPY.саУНФУправлениеАссортиментом/src/Documents/саУНФ_УстановкаАссортимента/саУНФ_УстановкаАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>саУНФ_УстановкаАссортимента</name>
  <registerRecords>InformationRegister.саУНФ_НормыАссортимента</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматМагазина</name>
    <type>
      <types>CatalogRef.саУНФ_ФорматыМагазинов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНаПаллете</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйЗапас</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UNFCOPY.саУНФУправлениеАссортиментом/src/InformationRegisters/саУНФ_НормыАссортимента/саУНФ_НормыАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>саУНФ_НормыАссортимента</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоНаПаллете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальныйЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФорматМагазина</name>
    <type>
      <types>CatalogRef.саУНФ_ФорматыМагазинов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UNFCOPY.саУНФУправлениеАссортиментом/src/Documents/саУНФ_УстановкаАссортимента/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.саУНФ_НормыАссортимента.Записывать = Истина;
	
	Для Каждого ТекСтрокаНоменклатура Из Номенклатура Цикл
			
		Движение 									= Движения.саУНФ_НормыАссортимента.Добавить();
		Движение.Период							= Дата;
		Движение.Организация 				= Организация;
		Движение.ФорматМагазина 			= ФорматМагазина;
		Движение.Номенклатура 				= ТекСтрокаНоменклатура.Номенклатура;
		Движение.Количество 					= ТекСтрокаНоменклатура.Количество;
		Движение.КоличествоНаПаллете	= ТекСтрокаНоменклатура.КоличествоНаПаллете;
		Движение.МинимальныйЗапас		= ТекСтрокаНоменклатура.МинимальныйЗапас;


	КонецЦикла;
		
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(ЭтотОбъект, Истина, Префикс);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Автор = Пользователи.ТекущийПользователь();

КонецПроцедуры
